# Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

day = int(input('Введите порядковый номер дня недели: '))

if 0 < day <= 5:
    print('К сожалению, это не выходной.')

elif 5 < day <= 7:
    print('Выходно-о-о-й ~(^.^)~')

else:
    print('Упс! Дня недели под таким номером нет, а Вам явно пора отдохнуть :(')
