# Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

day = int(input('Введите порядковый номер дня недели: '))

if day <= 0 or day > 7:
    print('Упс! Дня недели под таким номером нет, а Вам явно пора отдохнуть :(')

if 0 < day <= 5:
    print('К сожалению, это не выходной.')

if 5 < day <= 7:
    print('Выходно-о-о-й ~(^.^)~')